{
  "smelly": [
    "You feel bloated, as if you'd just drunk a very fizzy drink. Gas accumulates in your gut, causing you to burp often.",
    "You don't feel so good - must've been something you ate. Pressure builds as gas accumulates in your lower body.",
    "You... really need to go. Soon. Better find a bathroom!",
    "A new world of senses opens to you - your nose becomes hyper-sensitive, and you can now pick up on even the faintest scents.",
    "Have you showered? Your natural scent is very very strong.",
    "You feel strangely hot - you begin sweating all over."
  ],
  "warm": [
    "A warmth flushes through your body. Your body is much more sensitive.",
    "A warmth accumulates in your fingertips. Anything you touch with them tingles for several seconds.",
    "A warmth overtakes your cock if you have one, breasts otherwise. Your cum or milk production swells.",
    "A warmth fills your body, and you feel a deep sense of comfort. A magical effect on you of your choice ends.",
    "Your body fills with a youthful warmth! You are as tight and as sensitive as if you'd never been touched.",
    "A warmth spreads throughout your body. You become extremely ticklish!",
    "A warmth settles through your body. You smell nice, and those around you are comforted by the scent!"
  ],
  "sparkling": [
    "You have a very quick growthspurt! You grow around 2-3 feet (60-90 cm)!",
    "You suddenly feel so small - You shrink around 2-3 feet (60-90 cm)!",
    "You grow suddenly to almost triple in size! This specific effect wears off faster than the others, but only a magic user would know that...",
    "You shrink down until you are only inches tall! It wears off quicker than the other effects, but only a magic user would know that...",
    "Whenever someone repeats the next word you say, you shrink. The effect is weaker if a single person keeps repeating it.",
    "Whenever someone repeats the next word you say, you grow. The effect is weaker if a single person keeps repeating it.",
    "You gain the ability to adjust your height at will, but each time you do your body gets more and more excited",
    "Your cum takes on magical properties, and anyone who ingests enough of it will shrink in size!",
    "All the magic of the potion seeps into your cum. Anyone who ingests enough of your cum will grow in size!",
    "The potion gives you a bit of vertigo. You grow or shrink to the same height as the next person you lay eyes on!"
  ],
  "glowing": [
    "Your breasts glow, then grow several sizes!",
    "Your lower body glows: grow a cock if you don't have one, or the cock you have grows in size.",
    "Your hands tingle with a strange energy. You can steal others' assets with them. Everyone else gets a strange feeling that something's off about you when they see you.",
    "Your fingertips tingle with a strange energy. You can grow others' assets by touching them, but not your own.",
    "Your lower body glows: If you have a cock, your balls grow in size. If you don't have one, you grow one.",
    "Your lower body glows and you grow a fat cock, even if you already have one!",
    "Your ass begins to glow, and before you can react your ass swells and grows several sizes!",
    "The magic of the potion passes through you and mixes in with your cum. You gain the ability to grow or shrink at will the assets of anyone who ingests your cum!"
  ],
  "gooey": [
    "Your body feels strangely loose. It takes a little bit of practice, but you can morph and mold your body to your liking, as long as you have the mass for it.",
    "Your body becomes limber - very limber. Your body takes on a rubbery form, stretching easily.",
    "You feel a strange sense of raw [b]power[/b]. Your muscles feel stronger and looser and your whole body brims with a healthy energy.",
    "Your body fills with an odd lethargy. Your muscles feel just a bit weaker and tighter.",
    "Your tongue stretches in size, and you can stretch it out at least a foot in length. Still fits inside your mouth comfortably though. It's magic.",
    "When you focus too hard on any specific part of your body, it temporarily turns invisible! Good thing no one's going to tease you, right?",
    "An uncomfortable feeling wells inside of your gut, then spreads throughout your body. Your body looks like it's covered in a latex suit, but it's part of your body!",
    "All your hairs stand on end as a chill runs through your body, but you don't notice any effect other than that. Whenever you touch cum your body absorbs it, growing your own assets in exchange!"
  ],
  "striped": [
    "A hunger overtakes you, a hunger that can't be satisfied no matter how full you get",
    "Your body smells and tastes delicious! It rouses the hungers of everyone around",
    "An uncomfortable sensation spreads within you for a moment. You gain an extra mouth anywhere on your body.",
    "Your stomach shifts and groans, swelling with magic. No matter how big your meal, no bulge will appear outside your body.",
    "You don't notice any change immediately, but being near others slowly makes them more hungry.",
    "A warmth passed through you, and your cock or pussy aches with a need to be filled.",
    "Your nipples feel a bit different, and you can put just about anything inside - although you get the feeling that nothing but milk will come out."
  ],
  "bubbling": [
    "You feel a sharp pain for just a moment as a pair of wings sprout from just beyond your shoulderblades in your back!",
    "There's an itching right above your rear end, until with a loud tear of your clothing, you realized you grew a heart spaded tail!",
	"You can feel your ears move, and you can hear more and more... Until eventually, you have a pair of cat/dog/fox ears, and a matching tail!",
	"You feel a sharp pain in your head, before it passes... Reaching up, you can feel some cute little horns, but they're sharp!"
  ]
}